package homework.lessons.lesson06.lesson0603;
/*Описать класс StringStorage. В нем будет храниться массив строк,
сами строки задаются при создании объекта класса StringStorage, количество выберите сами.
Опишите в классе StringStorage метод, который принимает 2 целочисленных значения.
Метод должен менять местами строки, стоящие на позициях, которые мы ему передали.
Например: в массиве записаны строки {“a”, “d”, “c, “b”} , я вызываю метод changeOrder(1, 3),
после его работы массив должен выглядеть так: {“a”, “b”, “c, “d”}.
В случае, если в метод переданы невалидные значения (для примера выше, например, -1 или 7,
таких индексов в массиве не существует) – выводить на консоль сообщение об ошибке.
Не забудьте о каком-нибудь способе узнать, что находится в массиве внутри объекта.*/

public class Task03 {
    public static void main(String[] args) {
        StringStorage[] massiveString = {
                new StringStorage("dog", "cat", "like", "meet"),
                new StringStorage("Tom", "dont","Kate","meet"),
                new StringStorage("Jon", "coffee", "drink", "every day"),
        };

    }
}
